In [1]:
import sqlite3 as sql
import os
import pandas as pd

In [39]:
pd.options.display.max_rows = 1000
pd.options.display.width = 0
df  = pd.read_excel("data/fy2021cobbook9.xls", engine="xlrd",header=0,nrows=73)

In [3]:
country = df.iloc[2,0].replace("Region/Country: ","")
year = str(df.iloc[0:0,0:1].columns).strip("Index(['Persons Obtaining Lawful Permanent Resident Status During Fiscal Year '], dtype='object')")

In [4]:
df.iloc[2,0].replace("Region/Country: ","")
df["Region/Country"] = df.iloc[2,0].replace("Region/Country: ","")
df.columns = df.iloc[4]
df = df.rename(columns={df.iloc[1][-1]:"Region/Country"})
df = df.iloc[7:]
df = df.drop(columns="Total")

In [5]:
age = df.iloc[3:12]
age =age.iloc[1:]
age = age.rename(columns={"Characteristic":"Age"})
age = age.melt(id_vars=["Age"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [6]:
age["Country"] = country

In [7]:
age["Year"] = year

In [8]:
age

                  Age      Sex Count  Country  Year
0      Under 18 years   Female   297  Oceania  2021
1      18 to 24 years   Female   170  Oceania  2021
2      25 to 34 years   Female   649  Oceania  2021
3      35 to 44 years   Female   429  Oceania  2021
4      45 to 54 years   Female   223  Oceania  2021
5      55 to 64 years   Female    91  Oceania  2021
6   65 years and over   Female    42  Oceania  2021
7             Unknown   Female     -  Oceania  2021
8      Under 18 years     Male   300  Oceania  2021
9      18 to 24 years     Male   158  Oceania  2021
10     25 to 34 years     Male   773  Oceania  2021
11     35 to 44 years     Male   578  Oceania  2021
12     45 to 54 years     Male   274  Oceania  2021
13     55 to 64 years     Male   115  Oceania  2021
14  65 years and over     Male    47  Oceania  2021
15            Unknown     Male     -  Oceania  2021
16     Under 18 years  Unknown     -  Oceania  2021
17     18 to 24 years  Unknown     1  Oceania  2021
18     25 to 34 years  Unknown     -  Oceania  2021
19     35 to 44 years  Unknown     -  Oceania  2021
20     45 to 54 years  Unknown     -  Oceania  2021
21     55 to 64 years  Unknown     -  Oceania  2021
22  65 years and over  Unknown     -  Oceania  2021
23            Unknown  Unknown     -  Oceania  2021

In [9]:
marital = df.iloc[14:18]
marital = marital.melt(id_vars=["Characteristic"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
marital = marital.rename(columns={"Characteristic":"Marital_status"})

In [10]:
occupations = df.iloc[20:33]
occupations = occupations.rename(columns={"Characteristic":"Occupations"})
occupations = occupations.melt(id_vars=["Occupations"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [11]:
admission_class = df.iloc[35:41]
admission_class = admission_class.rename(columns={"Characteristic":"admission_class"})
admission_class = admission_class.melt(id_vars=["admission_class"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [12]:
states = df.iloc[43:65]
states = states.rename(columns={"Characteristic":"States"})
states = states.melt(id_vars=["States"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [13]:
display(
    age.head(3),
    marital.head(3),
    occupations.head(3),
    admission_class.head(3),
    states.head(3))

              Age     Sex Count  Country  Year
0  Under 18 years  Female   297  Oceania  2021
1  18 to 24 years  Female   170  Oceania  2021
2  25 to 34 years  Female   649  Oceania  2021

  Marital_status     Sex Count
0        Married  Female  1303
1         Single  Female   523
2          Other  Female    61

                                         Occupations     Sex Count
0  Management, professional, and related occupations  Female   437
1                                Service occupations  Female    70
2                       Sales and office occupations  Female   147

                        admission_class     Sex Count
0  Immediate relatives of U.S. citizens  Female  1080
1          Family-sponsored preferences  Female     D
2          Employment-based preferences  Female   532

       States     Sex Count
0     Arizona  Female    41
1  California  Female   573
2    Colorado  Female    53

In [2]:
directory = "data"

In [3]:
file_lists = []

In [4]:
for filename in os.listdir(directory):
    f = os.path.join(directory, filename)
    if os.path.isfile(f):
        file_lists.append(f)

In [5]:
age_list = []
marital_list = []
occupations_list = []
admissions_list = []
states_list = []

In [7]:
for i in file_lists:
    try:
        df = (pd.read_excel(i,engine="xlrd",header=0,nrows=73))
        country = df.iloc[2,0].replace("Region/Country: ","")
        year = str(df.iloc[0:0,0:1].columns).strip("Index(['Persons Obtaining Lawful Permanent Resident Status During Fiscal Year '], dtype='object')")
        df.iloc[2,0].replace("Region/Country: ","")
        df["Region/Country"] = df.iloc[2,0].replace("Region/Country: ","")
        df.columns = df.iloc[4]
        df = df.rename(columns={df.iloc[1][-1]:"Region/Country"})
        df = df.iloc[7:]
        df = df.drop(columns="Total")
        age = df.iloc[3:12]
        age =age.iloc[1:]
        age = age.rename(columns={"Characteristic":"Age"})
        age = age.melt(id_vars=["Age"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
        age["Country"] = country
        age["Year"] = year
        marital = df.iloc[14:18]
        marital = marital.melt(id_vars=["Characteristic"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
        marital = marital.rename(columns={"Characteristic":"Marital_status"})
        marital["Country"] = country
        marital["Year"] = year
        occupations = df.iloc[20:33]
        occupations = occupations.rename(columns={"Characteristic":"Occupations"})
        occupations = occupations.melt(id_vars=["Occupations"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")    
        occupations["Country"] = country
        occupations["Year"] = year
        admission_class = df.iloc[35:41]
        admission_class = admission_class.rename(columns={"Characteristic":"admission_class"})
        admission_class = admission_class.melt(id_vars=["admission_class"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
        admission_class["Country"] = country
        admission_class["Year"] = year    
        states = df.iloc[43:65]
        states = states.rename(columns={"Characteristic":"States"})
        states = states.melt(id_vars=["States"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
        states["Country"] = country
        states["Year"] = year


        age_list.append(age)
        marital_list.append(marital)
        occupations_list.append(occupations)
        admissions_list.append(admission_class)
        states_list.append(states)  
    except:
        print(i)

data/fy2020cobbook2.xls
data/fy2018cobbook2.xls
data/fy2016cobbook2.xls
data/fy2015cobbook2.xls
data/fy2019cobbook2.xls

In [8]:
age = pd.concat(age_list)
marital = pd.concat(marital_list)
occupations = pd.concat(occupations_list)
admission = pd.concat(admissions_list)
states = pd.concat(states_list)

In [9]:
display(
    age.head(3),
    marital.head(3),
    occupations.head(3),
    admission.head(3),
    states.head(3))

              Age     Sex Count   Country  Year
0  Under 18 years  Female  1196  Honduras  2018
1  18 to 24 years  Female  1263  Honduras  2018
2  25 to 34 years  Female  1398  Honduras  2018

  Marital_status     Sex Count   Country  Year
0        Married  Female  3597  Honduras  2018
1         Single  Female  3159  Honduras  2018
2          Other  Female   445  Honduras  2018

,Occupations,Sex,Count,Country,Year
0,"Management, professional, and related occupations",Female,223,Honduras,2018
1,Service occupations,Female,470,Honduras,2018
2,Sales and office occupations,Female,169,Honduras,2018

                        admission_class     Sex Count   Country  Year
0  Immediate relatives of U.S. citizens  Female  4336  Honduras  2018
1          Family-sponsored preferences  Female  1256  Honduras  2018
2          Employment-based preferences  Female   520  Honduras  2018

        States     Sex Count   Country  Year
0   California  Female   966  Honduras  2018
1     Colorado  Female    72  Honduras  2018
2  Connecticut  Female    63  Honduras  2018

In [10]:
Countries = ["India", "China", "Mexico", "Philippines", "Egypt","Pakistan","France","Bangladesh","Germany","Nigeria"]

In [11]:
age = age[age["Country"].isin(Countries)]
marital = marital[marital["Country"].isin(Countries)]
occupations = occupations[occupations["Country"].isin(Countries)]
admission = admission[admission["Country"].isin(Countries)]
states = states[states["Country"].isin(Countries)]

In [14]:
display(
    age.head(10),
    marital.head(10),
    occupations.head(10),
    admission.head(10),
    states.head(10))

                 Age     Sex Count Country  Year
0     Under 18 years  Female   377  France  2018
1     18 to 24 years  Female   147  France  2018
2     25 to 34 years  Female   682  France  2018
3     35 to 44 years  Female   415  France  2018
4     45 to 54 years  Female   176  France  2018
5     55 to 64 years  Female    53  France  2018
6  65 years and over  Female    44  France  2018
7            Unknown  Female     -  France  2018
8     Under 18 years    Male   420  France  2018
9     18 to 24 years    Male   148  France  2018

  Marital_status      Sex Count Country  Year
0        Married   Female  1228  France  2018
1         Single   Female   606  France  2018
2          Other   Female    37  France  2018
3        Unknown   Female    23  France  2018
4        Married     Male  1490  France  2018
5         Single     Male   852  France  2018
6          Other     Male    28  France  2018
7        Unknown     Male    11  France  2018
8        Married  Unknown     -  France  2018
9         Single  Unknown     -  France  2018

,Occupations,Sex,Count,Country,Year
0,"Management, professional, and related occupations",Female,443,France,2018
1,Service occupations,Female,49,France,2018
2,Sales and office occupations,Female,91,France,2018
3,"Farming, fishing, and forestry occupations",Female,-,France,2018
4,"Construction, extraction, maintenance and repa...",Female,D,France,2018
5,"Production, transportation, and material movin...",Female,5,France,2018
6,Military,Female,D,France,2018
7,No occupation/not working outside home,Female,755,France,2018
8,Homemakers,Female,123,France,2018
9,Students or children,Female,435,France,2018

                        admission_class     Sex Count Country  Year
0  Immediate relatives of U.S. citizens  Female   734  France  2018
1          Family-sponsored preferences  Female    67  France  2018
2          Employment-based preferences  Female   968  France  2018
3                             Diversity  Female   105  France  2018
4                  Refugees and asylees  Female    15  France  2018
5                                 Other  Female     5  France  2018
6  Immediate relatives of U.S. citizens    Male   862  France  2018
7          Family-sponsored preferences    Male    78  France  2018
8          Employment-based preferences    Male  1300  France  2018
9                             Diversity    Male   126  France  2018

          States     Sex Count Country  Year
0        Arizona  Female    10  France  2018
1     California  Female   435  France  2018
2       Colorado  Female    27  France  2018
3    Connecticut  Female    21  France  2018
4        Florida  Female   194  France  2018
5        Georgia  Female    29  France  2018
6       Illinois  Female    48  France  2018
7       Maryland  Female    46  France  2018
8  Massachusetts  Female    90  France  2018
9       Michigan  Female    29  France  2018

In [13]:
age.Year.value_counts()

2014    336
2016    312
2018    288
2019    288
2015    288
2021    264
2020    240
2017    192
Name: Year, dtype: int64